{"Bar_None": 0, "Note-On_0": 1, "Note-On_1": 2, "Note-On_2": 3, "Note-On_3": 4, "Note-On_4": 5, "Note-On_5": 6, "Note-On_6": 7, "Note-On_7": 8, "Note-On_8": 9, "Note-On_9": 10, "Note-On_10": 11, "Note-On_11": 12, "Note-On_12": 13, "Note-On_13": 14, "Note-On_14": 15, "Note-On_15": 16, "Note-On_16": 17, "Note-On_17": 18, "Note-On_18": 19, "Note-On_19": 20, "Note-On_20": 21, "Note-On_21": 22, "Note-On_22": 23, "Note-On_23": 24, "Note-On_24": 25, "Note-On_25": 26, "Note-On_26": 27, "Note-On_27": 28, "Note-On_28": 29, "Note-On_29": 30, "Note-On_30": 31, "Note-On_31": 32, "Note-On_32": 33, "Note-On_33": 34, "Note-On_34": 35, "Note-On_35": 36, "Note-On_36": 37, "Note-On_37": 38, "Note-On_38": 39, "Note-On_39": 40, "Note-On_40": 41, "Note-On_41": 42, "Note-On_42": 43, "Note-On_43": 44, "Note-On_44": 45, "Note-On_45": 46, "Note-On_46": 47, "Note-On_47": 48, "Note-On_48": 49, "Note-On_49": 50, "Note-On_50": 51, "Note-On_51": 52, "Note-On_52": 53, "Note-On_53": 54, "Note-On_54": 55, "Note-On_55": 56, "Note-On_56": 57, "Note-On_57": 58, "Note-On_58": 59, "Note-On_59": 60, "Note-On_60": 61, "Note-On_61": 62, "Note-On_62": 63, "Note-On_63": 64, "Note-On_64": 65, "Note-On_65": 66, "Note-On_66": 67, "Note-On_67": 68, "Note-On_68": 69, "Note-On_69": 70, "Note-On_70": 71, "Note-On_71": 72, "Note-On_72": 73, "Note-On_73": 74, "Note-On_74": 75, "Note-On_75": 76, "Note-On_76": 77, "Note-On_77": 78, "Note-On_78": 79, "Note-On_79": 80, "Note-On_80": 81, "Note-On_81": 82, "Note-On_82": 83, "Note-On_83": 84, "Note-On_84": 85, "Note-On_85": 86, "Note-On_86": 87, "Note-On_87": 88, "Note-On_88": 89, "Note-On_89": 90, "Note-On_90": 91, "Note-On_91": 92, "Note-On_92": 93, "Note-On_93": 94, "Note-On_94": 95, "Note-On_95": 96, "Note-On_96": 97, "Note-On_97": 98, "Note-On_98": 99, "Note-On_99": 100, "Note-On_100": 101, "Note-On_101": 102, "Note-On_102": 103, "Note-On_103": 104, "Note-On_104": 105, "Note-On_105": 106, "Note-On_106": 107, "Note-On_107": 108, "Note-On_108": 109, "Note-On_109": 110, "Note-On_110": 111, "Note-On_111": 112, "Note-On_112": 113, "Note-On_113": 114, "Note-On_114": 115, "Note-On_115": 116, "Note-On_116": 117, "Note-On_117": 118, "Note-On_118": 119, "Note-On_119": 120, "Note-On_120": 121, "Note-On_121": 122, "Note-On_122": 123, "Note-On_123": 124, "Note-On_124": 125, "Note-On_125": 126, "Note-On_126": 127, "Note-On_127": 128, "Note-Duration_1": 129, "Note-Duration_2": 130, "Note-Duration_3": 131, "Note-Duration_4": 132, "Note-Duration_5": 133, "Note-Duration_6": 134, "Note-Duration_7": 135, "Note-Duration_8": 136, "Note-Duration_9": 137, "Note-Duration_10": 138, "Note-Duration_11": 139, "Note-Duration_12": 140, "Note-Duration_13": 141, "Note-Duration_14": 142, "Note-Duration_15": 143, "Note-Duration_16": 144, "Note-Duration_17": 145, "Note-Duration_18": 146, "Note-Duration_19": 147, "Note-Duration_20": 148, "Note-Duration_21": 149, "Note-Duration_22": 150, "Note-Duration_23": 151, "Note-Duration_24": 152, "Note-Duration_25": 153, "Note-Duration_26": 154, "Note-Duration_27": 155, "Note-Duration_28": 156, "Note-Duration_29": 157, "Note-Duration_30": 158, "Note-Duration_31": 159, "Note-Duration_32": 160, "Note-Duration_33": 161, "Note-Duration_34": 162, "Note-Duration_35": 163, "Note-Duration_36": 164, "Note-Duration_37": 165, "Note-Duration_38": 166, "Note-Duration_39": 167, "Note-Duration_40": 168, "Note-Duration_41": 169, "Note-Duration_42": 170, "Note-Duration_43": 171, "Note-Duration_44": 172, "Note-Duration_45": 173, "Note-Duration_46": 174, "Note-Duration_47": 175, "Note-Duration_48": 176, "Note-Duration_49": 177, "Note-Duration_50": 178, "Note-Duration_51": 179, "Note-Duration_52": 180, "Note-Duration_53": 181, "Note-Duration_54": 182, "Note-Duration_55": 183, "Note-Duration_56": 184, "Note-Duration_57": 185, "Note-Duration_58": 186, "Note-Duration_59": 187, "Note-Duration_60": 188, "Note-Duration_61": 189, "Note-Duration_62": 190, "Note-Duration_63": 191, "Note-Duration_64": 192, "Note-Duration_triole": 193, "Position_1/16": 194, "Position_2/16": 195, "Position_3/16": 196, "Position_4/16": 197, "Position_5/16": 198, "Position_6/16": 199, "Position_7/16": 200, "Position_8/16": 201, "Position_9/16": 202, "Position_10/16": 203, "Position_11/16": 204, "Position_12/16": 205, "Position_13/16": 206, "Position_14/16": 207, "Position_15/16": 208, "Position_16/16": 209, "Position-Triole_1": 210, "Position-Triole_2": 211}