{"Bar_None": 0, "Note-On_60": 1, "Note-On_61": 2, "Note-On_62": 3, "Note-On_63": 4, "Note-On_64": 5, "Note-On_65": 6, "Note-On_66": 7, "Note-On_67": 8, "Note-On_68": 9, "Note-On_69": 10, "Note-On_70": 11, "Note-On_71": 12, "Note-On_72": 13, "Note-On_73": 14, "Note-On_74": 15, "Note-On_75": 16, "Note-On_76": 17, "Note-On_77": 18, "Note-On_78": 19, "Note-On_79": 20, "Note-On_80": 21, "Note-On_81": 22, "Note-On_82": 23, "Note-On_83": 24, "Note-On_84": 25, "Note-On_85": 26, "Note-On_86": 27, "Note-On_87": 28, "Note-On_88": 29, "Note-On_89": 30, "Note-On_90": 31, "Note-On_91": 32, "Note-On_92": 33, "Note-On_93": 34, "Note-On_94": 35, "Note-On_95": 36, "Note-Duration_1": 37, "Note-Duration_2": 38, "Note-Duration_3": 39, "Note-Duration_4": 40, "Note-Duration_5": 41, "Note-Duration_6": 42, "Note-Duration_7": 43, "Note-Duration_8": 44, "Note-Duration_9": 45, "Note-Duration_10": 46, "Note-Duration_11": 47, "Note-Duration_12": 48, "Note-Duration_13": 49, "Note-Duration_14": 50, "Note-Duration_15": 51, "Note-Duration_16": 52, "Note-Duration_17": 53, "Note-Duration_18": 54, "Note-Duration_19": 55, "Note-Duration_20": 56, "Note-Duration_21": 57, "Note-Duration_22": 58, "Note-Duration_23": 59, "Note-Duration_24": 60, "Note-Duration_25": 61, "Note-Duration_26": 62, "Note-Duration_27": 63, "Note-Duration_28": 64, "Note-Duration_29": 65, "Note-Duration_30": 66, "Note-Duration_31": 67, "Note-Duration_32": 68, "Note-Duration_33": 69, "Note-Duration_34": 70, "Note-Duration_35": 71, "Note-Duration_36": 72, "Note-Duration_37": 73, "Note-Duration_38": 74, "Note-Duration_39": 75, "Note-Duration_40": 76, "Note-Duration_41": 77, "Note-Duration_42": 78, "Note-Duration_43": 79, "Note-Duration_44": 80, "Note-Duration_45": 81, "Note-Duration_46": 82, "Note-Duration_47": 83, "Note-Duration_48": 84, "Note-Duration_49": 85, "Note-Duration_50": 86, "Note-Duration_51": 87, "Note-Duration_52": 88, "Note-Duration_53": 89, "Note-Duration_54": 90, "Note-Duration_55": 91, "Note-Duration_56": 92, "Note-Duration_57": 93, "Note-Duration_58": 94, "Note-Duration_59": 95, "Note-Duration_60": 96, "Note-Duration_61": 97, "Note-Duration_62": 98, "Note-Duration_63": 99, "Note-Duration_64": 100, "Position_1/16": 101, "Position_2/16": 102, "Position_3/16": 103, "Position_4/16": 104, "Position_5/16": 105, "Position_6/16": 106, "Position_7/16": 107, "Position_8/16": 108, "Position_9/16": 109, "Position_10/16": 110, "Position_11/16": 111, "Position_12/16": 112, "Position_13/16": 113, "Position_14/16": 114, "Position_15/16": 115, "Position_16/16": 116}